/*
 * This Java source file was generated by the Gradle 'init' task.
 */
package org.example;

// Создать консольное приложение с помощью системы автоматической сборки gradle, вывести на экран надпись “Hello, Java!”
public class App {
    public String getGreeting() {
        return "Hello World!";
    }

    public static void main(String[] args) {
        System.out.println(new App().getGreeting());
    }
}
